In [ ]:
"""Find information about all employees with an odd emp_no and whose last name is not Mary, order by hire_date descending"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  `employees` ; 
CREATE TABLE `employees` (
`emp_no` int(11) NOT NULL,
`birth_date` date NOT NULL,
`first_name` varchar(14) NOT NULL,
`last_name` varchar(16) NOT NULL,
`gender` char(1) NOT NULL,
`hire_date` date NOT NULL,
PRIMARY KEY (`emp_no`));

INSERT INTO employees VALUES(10001,'1953-09-02','Georgi','Facello','M','1986-06-26');
INSERT INTO employees VALUES(10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21');
INSERT INTO employees VALUES(10003,'1959-12-03','Bezalel','Mary','M','1986-08-28');
INSERT INTO employees VALUES(10004,'1954-05-01','Chirstian','Koblick','M','1986-12-01');
INSERT INTO employees VALUES(10005,'1953-11-07','Mary','Sluis','F','1990-01-22');

In [ ]:
"""SQL solution"""
SELECT *
FROM employees
WHERE MOD(emp_no, 2) = 1
# or: emp_no%2 = 1
# or: emp_no & 1
AND last_name != 'Mary'
# or: last_name <> 'Mary'
# or: last_name NOT IN ('Mary')
ORDER BY hire_date DESC

In [15]:
"""Pandas dataframe creation"""
import pandas as pd
import numpy as np

t_e = np.array([[10001,'1953-09-02','Georgi','Facello','M','1986-06-26'],
                [10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21'],
                [10003,'1959-12-03','Bezalel','Mary','M','1986-08-28'],
                [10004,'1954-05-01','Chirstian','Koblick','M','1986-12-01'],
                [10005,'1953-11-07','Mary','Sluis','F','1990-01-22']])
employees = pd.DataFrame(data=t_e, columns=['emp_no', 'birth_date', 'first_name', 'last_name', 'gender', 'hire_date'])
employees.head()

  emp_no  birth_date first_name last_name gender   hire_date
0  10001  1953-09-02     Georgi   Facello      M  1986-06-26
1  10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2  10003  1959-12-03    Bezalel      Mary      M  1986-08-28
3  10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4  10005  1953-11-07       Mary     Sluis      F  1990-01-22

In [24]:
# data types for all columns
employees.dtypes

emp_no        object
birth_date    object
first_name    object
last_name     object
gender        object
hire_date     object
dtype: object

In [25]:
# data type for a single column
employees['emp_no'].dtype

dtype('O')

In [ ]:
employees.loc[:,employees['emp_no']%2 == 1]  and employees['last_name']!='Mary'

In [26]:
# convert emp_no from string to int for following operation
employees['emp_no'] = employees['emp_no'].astype('int')
employees.dtypes

emp_no         int64
birth_date    object
first_name    object
last_name     object
gender        object
hire_date     object
dtype: object

In [40]:
employees[employees['emp_no']%2==1]

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
2   10003  1959-12-03    Bezalel      Mary      M  1986-08-28
4   10005  1953-11-07       Mary     Sluis      F  1990-01-22

In [39]:
employees[employees['last_name']!='Mary']

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1953-11-07       Mary     Sluis      F  1990-01-22

In [41]:
employees[(employees['emp_no']%2 == 1) & (employees['last_name']!='Mary')].sort_values('hire_date', ascending=False)

   emp_no  birth_date first_name last_name gender   hire_date
4   10005  1953-11-07       Mary     Sluis      F  1990-01-22
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26